In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("sample.csv")

In [5]:
df

   ID    Name  Price
0   1  Item A    100
1   2  Item B    200
2   3  Item C    300

In [8]:
print(df.to_dict())

{'ID': {0: 1, 1: 2, 2: 3}, 'Name': {0: 'Item A', 1: 'Item B', 2: 'Item C'}, 'Price': {0: 100, 1: 200, 2: 300}}

In [9]:

ele = {
    "cars":["BMW","volvo","honda"],
    "passing":[1,2,3]
}

In [10]:
ele

{'cars': ['BMW', 'volvo', 'honda'], 'passing': [1, 2, 3]}

In [12]:
df = pd.DataFrame(ele)

In [13]:
df

    cars  passing
0    BMW        1
1  volvo        2
2  honda        3

In [14]:
print(pd.__version__)

2.2.3

In [19]:
lis = ["abhi","anshul","ram","shyam"]

In [24]:
df = pd.Series(lis, index = ["x","y","z","c"])

In [25]:
df

x      abhi
y    anshul
z       ram
c     shyam
dtype: object

In [28]:
print(df[0])

abhi

C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_11932\1138601271.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df[0])

In [36]:
dis = {
    "day1":[1,2,4,5,56],
    "day2":[3,46,7,5,7]

}

In [70]:
df = pd.DataFrame(dis, index = ["x","y","z","b","c"])

In [71]:
df

   day1  day2
x     1     3
y     2    46
z     4     7
b     5     5
c    56     7

In [72]:
print(df.loc["x"])

day1    1
day2    3
Name: x, dtype: int64

In [51]:
df.loc[0]

day1    1
day2    3
Name: 0, dtype: int64

In [52]:
df.loc[1]

day1     2
day2    46
Name: 1, dtype: int64

In [53]:
df

   day1  day2
0     1     3
1     2    46
2     4     7
3     5     5
4    56     7

In [64]:
df.iloc[0:5]

   day1  day2
0     1     3
1     2    46
2     4     7
3     5     5
4    56     7

In [65]:
df.loc[1]

day1     2
day2    46
Name: 1, dtype: int64

In [73]:
df = pd.read_csv("sample.csv")

In [74]:
df

   ID    Name  Price
0   1  Item A    100
1   2  Item B    200
2   3  Item C    300

In [76]:
df = pd.read_csv("data.csv")

In [79]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [85]:
print(pd.options.display.max_rows)

60

In [86]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [89]:
pd.options.display.max_rows = 170

In [90]:
pd.options.display.max_rows

170

In [91]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.0
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.0
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [97]:
df = pd.read_json("file.json")

In [98]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
5          60    102       127     300.5
6          60    110       136     374.0
7          45    104       134     253.3
8          30    109       133     195.1
9          60     98       124     269.0
10         60    103       147     329.3
11         60    100       120     250.7
12         60    106       128     345.3
13         60    104       132     379.3
14         60     98       123     275.0
15         60     98       120     215.2
16         60    100       120     300.0
17         45     90       112       NaN
18         60    103       123     323.0
19         45     97       125     243.0
20         60    108       131     364.2
21         45    100       119     282.0
22         60    130       101     300.0
23         45    105       132     246.0
24         60    102       126     334.5
25         60    100       120     250.0
26         60     92       118     241.0
27         60    103       132       NaN
28         60    100       132     280.0
29         60    102       129     380.3
30         60     92       115     243.0
31         45     90       112     180.1
32         60    101       124     299.0
33         60     93       113     223.0
34         60    107       136     361.0
35         60    114       140     415.0
36         60    102       127     300.5
37         60    100       120     300.1
38         60    100       120     300.0
39         45    104       129     266.0
40         45     90       112     180.1
41         60     98       126     286.0
42         60    100       122     329.4
43         60    111       138     400.0
44         60    111       131     397.0
45         60     99       119     273.0
46         60    109       153     387.6
47         45    111       136     300.0
48         45    108       129     298.0
49         60    111       139     397.6
50         60    107       136     380.2
51         80    123       146     643.1
52         60    106       130     263.0
53         60    118       151     486.0
54         30    136       175     238.0
55         60    121       146     450.7
56         60    118       121     413.0
57         45    115       144     305.0
58         20    153       172     226.4
59         45    123       152     321.0
60        210    108       160    1376.0
61        160    110       137    1034.4
62        160    109       135     853.0
63         45    118       141     341.0
64         20    110       130     131.4
65        180     90       130     800.4
66        150    105       135     873.4
67        150    107       130     816.0
68         20    106       136     110.4
69        300    108       143    1500.2
70        150     97       129    1115.0
71         60    109       153     387.6
72         90    100       127     700.0
73        150     97       127     953.2
74         45    114       146     304.0
75         90     98       125     563.2
76         45    105       134     251.0
77         45    110       141     300.0
78        120    100       130     500.4
79        270    100       131    1729.0
80         30    159       182     319.2
81         45    149       169     344.0
82         30    103       139     151.1
83        120    100       130     500.0
84         45    100       120     225.3
85         30    151       170     300.1
86         45    102       136     234.0
87        120    100       157    1000.1
88         45    129       103     242.0
89         20     83       107      50.3
90        180    101       127     600.1
91         45    107       137       NaN
92         30     90       107     105.3
93         15     80       100      50.5
94         20    150       171     127.4
95         20    151       168     229.4
96         30     95       128     128.2
97         25    152       168     244.2
98         30    109       131     188.2
99         90     93       124     604.1
100        20     95       112      77.7
101        90     90       110     500.0
102        90     90       100     500.0
103        90     90       100     500.4
104        30     92       108      92.7
105        30     93       128     124.0
106       180     90       120     800.3
107        30     90       120      86.2
108        90     90       120     500.3
109       210    137       184    1860.4
110        60    102       124     325.2
111        45    107       124     275.0
112        15    124       139     124.2
113        45    100       120     225.3
114        60    108       131     367.6
115        60    108       151     351.7
116        60    116       141     443.0
117        60     97       122     277.4
118        60    105       125       NaN
119        60    103       124     332.7
120        30    112       137     193.9
121        45    100       120     100.7
122        60    119       169     336.7
123        60    107       127     344.9
124        60    111       151     368.5
125        60     98       122     271.0
126        60     97       124     275.3
127        60    109       127     382.0
128        90     99       125     466.4
129        60    114       151     384.0
130        60    104       134     342.5
131        60    107       138     357.5
132        60    103       133     335.0
133        60    106       132     327.5
134        60    103       136     339.0
135        20    136       156     189.0
136        45    117       143     317.7
137        45    115       137     318.0
138        45    113       138     308.0
139        20    141       162     222.4
140        60    108       135     390.0
141        60     97       127       NaN
142        45    100       120     250.4
143        45    122       149     335.4
144        60    136       170     470.2
145        45    106       126     270.8
146        60    107       136     400.0
147        60    112       146     361.9
148        30    103       127     185.0
149        60    110       150     409.4
150        60    106       134     343.0
151        60    109       129     353.2
152        60    109       138     374.0
153        30    150       167     275.8
154        60    105       128     328.0
155        60    111       151     368.5
156        60     97       131     270.4
157        60    100       120     270.4
158        60    114       150     382.8
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [99]:

data = {
  "Duration":{
    "0":60,
    "1":60,
    "2":60,
    "3":45,
    "4":45,
    "5":60
  },
  "Pulse":{
    "0":110,
    "1":117,
    "2":103,
    "3":109,
    "4":117,
    "5":102
  },
  "Maxpulse":{
    "0":130,
    "1":145,
    "2":135,
    "3":175,
    "4":148,
    "5":127
  },
  "Calories":{
    "0":409,
    "1":479,
    "2":340,
    "3":282,
    "4":406,
    "5":300
  }
}

In [100]:
data

{'Duration': {'0': 60, '1': 60, '2': 60, '3': 45, '4': 45, '5': 60},
 'Pulse': {'0': 110, '1': 117, '2': 103, '3': 109, '4': 117, '5': 102},
 'Maxpulse': {'0': 130, '1': 145, '2': 135, '3': 175, '4': 148, '5': 127},
 'Calories': {'0': 409, '1': 479, '2': 340, '3': 282, '4': 406, '5': 300}}

In [101]:
df = pd.DataFrame(data)

In [102]:
df

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479
2        60    103       135       340
3        45    109       175       282
4        45    117       148       406
5        60    102       127       300

In [103]:
df.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       409
1        60    117       145       479

In [105]:
df.tail(2)

   Duration  Pulse  Maxpulse  Calories
4        45    117       148       406
5        60    102       127       300

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  6 non-null      int64
 1   Pulse     6 non-null      int64
 2   Maxpulse  6 non-null      int64
 3   Calories  6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes

In [110]:
# list to list

In [111]:
empdata = [[101,'A',564534],[102,'B',34343434],[103,'C',535353]]

In [112]:
empdata

[[101, 'A', 564534], [102, 'B', 34343434], [103, 'C', 535353]]

In [113]:
df = pd.DataFrame(empdata)

In [114]:
df

     0  1         2
0  101  A    564534
1  102  B  34343434
2  103  C    535353

In [115]:
lis = [1,2,34,54,6,67,8]

In [116]:
df = pd.DataFrame(lis)

In [117]:
df

    0
0   1
1   2
2  34
3  54
4   6
5  67
6   8

In [118]:
empdata = ((101,'A',564534),(102,'B',34343434),(103,'C',535353))

In [119]:
df = pd.DataFrame(empdata)

In [120]:
df

     0  1         2
0  101  A    564534
1  102  B  34343434
2  103  C    535353

In [121]:
empdata = {'id':[101,102,103],
           'name':['a','b','c'],
           'city':['p','q','s']
          }

In [122]:
df = pd.DataFrame(empdata)

In [123]:
df

    id name city
0  101    a    p
1  102    b    q
2  103    c    s

In [125]:
df = pd.read_excel("FSI-2023-DOWNLOAD.xlsx")

In [126]:
df

,Country,Year,Rank,Total,S1: Demographic Pressures,S2: Refugees and IDPs,C3: Group Grievance,E3: Human Flight and Brain Drain,E2: Economic Inequality,E1: Economy,P1: State Legitimacy,P2: Public Services,P3: Human Rights,C1: Security Apparatus,C2: Factionalized Elites,X1: External Intervention
0,Somalia,2023,1st,111.9,10.0,9.0,8.7,8.6,9.1,9.5,9.6,9.8,9.0,9.5,10.0,9.1
1,Yemen,2023,2nd,108.9,9.6,9.6,8.8,6.4,7.9,9.9,9.8,9.6,9.6,8.6,9.9,9.2
2,South Sudan,2023,3rd,108.5,9.7,10.0,8.6,6.5,8.6,8.6,9.8,9.7,8.7,9.9,9.2,9.2
3,Congo Democratic Republic,2023,4th,107.2,9.7,9.8,9.4,6.4,8.4,8.1,9.3,9.3,9.3,8.8,9.6,9.1
4,Syria,2023,5th,107.1,7.4,9.1,9.1,8.0,6.5,9.6,10.0,9.0,9.1,9.4,9.9,10.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
174,Switzerland,2023,175th,17.8,2.4,3.2,2.1,1.0,2.4,1.6,0.3,1.6,0.4,1.4,1.0,0.4
175,New Zealand,2023,176th,16.7,1.1,1.2,2.0,1.6,2.6,2.6,0.5,1.1,0.5,1.6,1.4,0.5
176,Finland,2023,177th,16.0,1.7,1.9,0.3,1.5,1.6,2.7,0.4,1.0,0.5,2.0,1.4,1.0
177,Iceland,2023,178th,15.7,1.5,1.5,0.5,1.6,1.5,2.6,0.4,0.9,0.4,0.4,1.8,2.6
178,Norway,2023,179th,14.5,1.4,1.7,3.1,0.7,1.4,1.4,0.4,1.0,0.4,1.4,1.1,0.5

In [128]:
df.loc[[1,2,5,6]]

,Country,Year,Rank,Total,S1: Demographic Pressures,S2: Refugees and IDPs,C3: Group Grievance,E3: Human Flight and Brain Drain,E2: Economic Inequality,E1: Economy,P1: State Legitimacy,P2: Public Services,P3: Human Rights,C1: Security Apparatus,C2: Factionalized Elites,X1: External Intervention
1,Yemen,2023,2nd,108.9,9.6,9.6,8.8,6.4,7.9,9.9,9.8,9.6,9.6,8.6,9.9,9.2
2,South Sudan,2023,3rd,108.5,9.7,10.0,8.6,6.5,8.6,8.6,9.8,9.7,8.7,9.9,9.2,9.2
5,Afghanistan,2023,6th,106.6,9.2,8.6,8.3,8.5,8.2,9.6,9.4,10.0,8.7,9.7,8.7,7.7
6,Sudan,2023,7th,106.2,8.8,9.6,9.3,7.5,8.5,9.3,9.4,8.6,9.2,8.3,9.6,8.1

In [129]:
import pandas as pd

df = pd.read_excel("empdata (1).xlsx")

In [4]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [5]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [6]:
df.shape

(4, 4)

In [11]:
df.info

<bound method DataFrame.info of       id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune>

In [14]:
df.head(2)

      id    name dept Region
0    434  keshav   IT   Pune
1  43423  Pratik   HR   Pune

In [15]:
df.tail(2)

      id    name   dept Region
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [16]:
df['name']

0    keshav
1    Pratik
2    Sonali
3      Amit
Name: name, dtype: object

In [20]:
df.get('ename','No col with you"r name')

'No col with you"r name'

In [22]:
df[['name','id']]

     name     id
0  keshav    434
1  Pratik  43423
2  Sonali  43434
3    Amit  32342

In [27]:
df['id'].astype(float)

0      434.0
1    43423.0
2    43434.0
3    32342.0
Name: id, dtype: float64

In [24]:
df['name']

0    keshav
1    Pratik
2    Sonali
3      Amit
Name: name, dtype: object

In [28]:
df.columns

Index(['id', 'name', 'dept', 'Region'], dtype='object')

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [30]:
df.size

16

In [31]:
df.ndim

2

In [32]:
lis =[1,2,343,4,6,5]

In [36]:
dd = pd.Series(lis)

In [37]:
dd.ndim

1

In [38]:
dd

0      1
1      2
2    343
3      4
4      6
5      5
dtype: int64

In [41]:
df.describe()

                 id
count      4.000000
mean   29908.250000
std    20332.641514
min      434.000000
25%    24365.000000
50%    37882.500000
75%    43425.750000
max    43434.000000

In [42]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [46]:
df.loc[1:3 , ["name","id"]]

     name     id
1  Pratik  43423
2  Sonali  43434
3    Amit  32342

In [47]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [52]:
df.iat[1,1]

'Pratik'

In [66]:
df.query('id' == 
         2)

ValueError: expr must be a string to be evaluated, <class 'bool'> given

In [67]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [73]:
df[df["name"].isin(["Pratik"])]

      id    name dept Region
1  43423  Pratik   HR   Pune

In [74]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [81]:
df.sample(2)

      id    name   dept Region
3  32342    Amit     HR   Pune
2  43434  Sonali  Admin   Pune

In [82]:
df["id"] = df["id"]*2

In [93]:
df

      id    name   dept Region
0    868  keshav     IT   Pune
2  86868  Sonali  Admin   Pune
3  64684    Amit     HR   Pune

In [90]:
df.drop(1, axis = 0,inplace =True)

In [92]:
df

      id    name   dept Region
0    868  keshav     IT   Pune
2  86868  Sonali  Admin   Pune
3  64684    Amit     HR   Pune

In [95]:
df.drop(columns = ["dept","id"])

     name Region
0  keshav   Pune
2  Sonali   Pune
3    Amit   Pune

In [97]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [108]:
df.drop

<bound method DataFrame.drop of       id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune>

In [113]:
df.rename({"id":"emp_id"},axis = 1 ,inplace =True)

In [114]:
df

   emp_id    name   dept Region
0     434  keshav     IT   Pune
1   43423  Pratik     HR   Pune
2   43434  Sonali  Admin   Pune
3   32342    Amit     HR   Pune

In [119]:
col = ['a','b','c','d']

col1 = ['p','q','r']

In [123]:
tuple(zip(col,col1))

(('a', 'p'), ('b', 'q'), ('c', 'r'))

In [125]:
df["name"] = None

In [126]:
df

   emp_id  name   dept Region
0     434  None     IT   Pune
1   43423  None     HR   Pune
2   43434  None  Admin   Pune
3   32342  None     HR   Pune

In [128]:
df

KeyError: 0

In [130]:
df

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [132]:
df.replace("keshav","ram")

      id    name   dept Region
0    434     ram     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [142]:
df.replace(["Pratik",None] ,axis =1)

TypeError: NDFrame.replace() got an unexpected keyword argument 'axis'

In [143]:
df.dropna()

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [149]:
df.drop_duplicates()

      id    name   dept Region
0    434  keshav     IT   Pune
1  43423  Pratik     HR   Pune
2  43434  Sonali  Admin   Pune
3  32342    Amit     HR   Pune

In [150]:
dd

0      1
1      2
2    343
3      4
4      6
5      5
dtype: int64

In [152]:
pd.DataFrame(lis)

     0
0    1
1    2
2  343
3    4
4    6
5    5

In [155]:
pd.concat([dd,df],axis =1)

     0       id    name   dept Region
0    1    434.0  keshav     IT   Pune
1    2  43423.0  Pratik     HR   Pune
2  343  43434.0  Sonali  Admin   Pune
3    4  32342.0    Amit     HR   Pune
4    6      NaN     NaN    NaN    NaN
5    5      NaN     NaN    NaN    NaN

In [146]:
import pandas as pd

In [147]:
df = pd.read_excel("Book 6.xlsx",sheet_name = "Sheet2")

In [148]:
df

   p_id  dimension
0   101        NaN
1   103        NaN
2   102     1200.0

In [149]:
ff = pd.read_excel("Book 6.xlsx",sheet_name = "Sheet1")

In [150]:
ff

   p_id pn   pp origin destination     l     w     h     cbm
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN

In [28]:
for i in range(0,len(ff['cbm'])+1):
    temp = ff['cbm'].iat[i]
    print(temp)

1000.0
nan
nan

IndexError: index 3 is out of bounds for axis 0 with size 3

In [12]:
def user():
    for i in range(0,len(ff['cbm'])+1):
        if ff['cbm'].isna.loc(i):
            if (ff['l'].loc[i] * ff['w'].loc[i] * ff['h'].loc[i] == 'NaN'):
                ff['new'].loc[i] =df['dimension'].loc(i)

            else:
                temp = ff['l'].loc[i] * ff['w'].loc[i] * ff['h'].loc[i]
                ff['new'] = temp
        else:
            ff['new'] = ff['cbm'].loc(i)

In [36]:
print(ff['cbm'].isna().loc[1])

True

In [33]:
ff

   p_id pn   pp origin destination     l     w     h     cbm
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN

In [13]:
ff['new'] = user()

ValueError: No axis named 1 for object type Series

In [45]:
ff['cbm'].isna().loc(1)

ValueError: No axis named 1 for object type Series

In [1]:
df

NameError: name 'df' is not defined

In [5]:
df

   p_id  dimension
0   101        NaN
1   103        NaN
2   102     1200.0

In [6]:
ff

   p_id pn   pp origin destination     l     w     h     cbm
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN

In [121]:
def user():
    for i in range(0,3):
        if pd.isna(ff['cbm'].loc[i]):
            if ff['l'].loc[i] * ff['w'].loc[i] * ff['h'].loc[i] == 0:
                if pd.isna(df['dimension'].loc[i]):
                    ff['new'] = 0
                else:
                    ff['new'] = df['dimension']
            else:
                temp = ff['l'].loc[i] * ff['w'].loc[i] * ff['h'].loc[i]
                ff['new'] = temp
        else:
            ff.loc[i, 'new'] = float(ff.loc[i, 'cbm'])

In [122]:
user()

In [11]:
print(temp)

1000.0

In [39]:
pd.isna(ff['cbm'].at[1])

True

In [123]:
ff

   p_id pn   pp origin destination     l     w     h     cbm  new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  NaN
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN  NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN  NaN

In [58]:
temp = float(ff['cbm'].loc[0])

temp

In [59]:
temp

1000.0

In [88]:
def user():
    j = 0
    for i in ff['cbm']:
        if pd.isna(i):



            
        else:
            ff['new'][j] = i
            j+= 1

In [89]:
user()

nan
nan

C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_11272\1336663258.py:7: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ff['new'][j] = i
C:\Users\ABHISHEK\AppData\Local\Temp\ipykernel_11272\1336663258.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ff['new'][j] = i

In [90]:
ff

   p_id pn   pp origin destination     l     w     h     cbm     new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN     NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN     NaN

In [98]:
float(ff['cbm'].loc[1])

nan

In [111]:
for i in range(0,3):
    temp = float(ff['cbm'].loc[i])
    ff[ff['new'].at[i,temp]]

KeyError: (0, 1000.0)

In [108]:
ff

   p_id pn   pp origin destination     l     w     h     cbm  new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  NaN
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN  NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN  NaN

In [119]:
ff.loc[0, 'new'] = float(ff.loc[i, 'cbm'])

In [120]:
ff

   p_id pn   pp origin destination     l     w     h     cbm     new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN     NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN     NaN

In [124]:
ff

   p_id pn   pp origin destination     l     w     h     cbm  new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  NaN
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN  NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN  NaN

In [166]:
def user():
    for i in range(0,3):
        if pd.isna(ff['cbm'].loc[i]):
            if pd.isna(ff['l'].loc[i] * ff['w'].loc[i] * ff['h'].loc[i]):
                if pd.isna(df['dimension'].loc[i]):
                    ff.loc[i,'new'] = 0
                else:
                    ff.loc[i,'new'] = float(df['dimension'].loc[i])
            else:
                ff.loc[i, 'new'] = ff['l'].loc[i] * ff['w'].loc[i] * ff['h'].loc[i]
                
        else:
            ff.loc[i, 'new'] = float(ff.loc[i, 'cbm'])

In [167]:
user()

In [168]:
ff

   p_id pn   pp origin destination     l     w     h     cbm     new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN  9384.0
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN     0.0

In [164]:
df.loc[2,'dimension'] = 0

In [152]:
ff.loc[2,'new']=float(df['dimension'].loc[2])

In [165]:
df

   p_id  dimension
0   101        NaN
1   103        NaN
2   102        0.0

In [163]:
ff

   p_id pn   pp origin destination     l     w     h     cbm     new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0  1000.0
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN  9384.0
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN  1200.0

In [153]:
ff

   p_id pn   pp origin destination     l     w     h     cbm     new
0   101  c  755    pne          gj  20.0  11.0  23.0  1000.0     NaN
1   102  s  565    mum          dl  12.0  34.0  23.0     NaN     NaN
2   103  g  456    chl         bng   NaN   NaN   NaN     NaN  1200.0

In [169]:
import pandas as pd

In [172]:
df = pd.DataFrame({
    'id ': [1,2,3],
    'name ' : ["abhi","ram","shyam"],
    'date': ['01-01-2020','01-01-2020','01-01-2020']
})

In [173]:
df

   id   name         date
0    1   abhi  01-01-2020
1    2    ram  01-01-2020
2    3  shyam  01-01-2020

In [174]:
df.dtypes

id        int64
name     object
date     object
dtype: object

In [184]:
dfpd.to_datetime(df['date'])

0   2020-01-01
1   2020-01-01
2   2020-01-01
Name: date, dtype: datetime64[ns]